Repository: pypingou/pypass
Catalog: pypass/locale/*/LC_MESSAGES/pypass.po
Languages: fr

source: Common options
fr: Options communes

source: The accounts database file, this override the default value
fr: Le fichier de base de données des comptes, surplante la valeur par défaut

source: Be a bit more verbose.
fr: Être un peu plus verbeux.

source: Activate debug mode (show executed commands, etc.).
fr: Activer le mode déboguage (afficher les commandes exécutées, etc.).

source: Exit on user request
fr: Sortie à la demande de l'utilisateur

source: Query options
fr: Options d'interrogation

source: List folders
fr: Liste des dossiers

source: Retrieve an account by its ID
fr: Chercher un compte par son ID

source: Edition options
fr: Options d'édition

source: Save configuration in your preferences file (%s).
fr: Sauvegarder la configuration dans votre fichier de préférences (%s).

source: Opening file %s
fr: Ouverture du fichier %s

source: Could not decrypt file %s
fr: Impossible de déchiffrer le fichier %s

source: File %s does not exists.
fr: Le fichier %s n'existe pas.

source: An error occured loading folder.
fr: Une erreur est survenue au chargement du dossier.

source: Application configuration file: %s
fr: Fichier de configuration de l'application : %s

source: Configuration file: %s
fr: Fichier de configuration : %s

source: All printable (excluding space)
fr: Tous les caractères imprimables (à l'exception des espaces)

source: Alpha-numeric (a-z, A-Z, 0-9)
fr: Alpha-numériques (a-z,A-Z,0-9)

source: Alpha lower-case (a-z)
fr: Alphabétiques minuscules (a-z)

source: Hexadecimal (0-9, A-F)
fr: Hexadécimal (0-9,A-F)

source: Decimal (0-9)
fr: Décimal (0-9)

source: Configuration loaded: - file: %(file)s - recipients: %(recipients)s - password length: %(passlength)i - password base: %(passbase)i
fr: Fichier de configuration chargé : - fichier : %(file)s - destinataires : %(recipients)s - taille des mots de passe : %(passlength)i - base des mots de passe : %(passbase)i

source: Trying to set a value for file with a missing parent. %s
fr: Tentative de modification d'une valeur pour un fichier dont un parent est manquant. %sento

source: Setting file to: %s
fr: Modification de file pour : %s

source: Trying to set passwords
fr: Tentative de modification de passwords

source: Trying to change characters_sets
fr: Tentative de modification de characters_setsop

source: Trying to get index %(index)d for a %(items)d items list; switching index to %(default)d
fr: Tentative d'obtention de l'index %(index)d sur une liste de %(items)d termes, modification de l'index à %(default)d

source: Retrieving character set %(index)d (%(name)s, `%(chars)s`)
fr: Récupération du jeu de caractères %(index)d (%(name)s, `%(chars)s`)

source: Update user config file
fr: Mise à jour du fichier de configuration de l'utilisateur

source: GTK is not available.
fr: GTK n'est pas disponible.

source: Welcome into pypass
fr: Bienvenue dans PyPass

source: This database has been modified
fr: Cette base de données a été modifiée.

source: Error
fr: Erreur

source: Do you want to save file before quit?
fr: Voulez-vous sauvegarder le fichier avant de quitter ?

source: Key ID
fr: ID de la clé

source: Add a folder
fr: Ajouter un dossier

source: Open a database
fr: Ouvrir une base de données

source: The key set as to encrypt this file is not installed in this machine, do you want to continue ?
fr: La clé sélectionnée pour chiffrer ce fichier n'est pas installée sur cette machine, souhaitez-vous continuer ?

source: The database could not be saved!
fr: La base de données n'a pas pu être sauvegardée !

source: The key could not be found
fr: La clé n'a pas pu être trouvée

source: Database saved
fr: Base de données sauvegardée

source: Save a database
fr: Sauvegarder une base de données

source: This database already exists
fr: Cette base de données existe déjà

source: Do you want to overrite it ?
fr: Souhaitez-vous l'écraser ?

source: Other key:
fr: Autre clé :

source: Account updated
fr: Compte mis à jour

source: You are going to remove %s.
fr: Vous êtes sur le point de supprimer %s.

source: Do you want to continue ?
fr: Souhaitez-vous continuer ?

source: Item removed
fr: Élément supprimé

source: Could not create the folder.
fr: Impossible de créer le dossier.

source: Name was missing.
fr: Le nom était manquant.

source: Could not add the account
fr: Impossible de créer le compte

source: Name and password are both required.
fr: Les nom et mot de passe sont tous deux requis.

source: There is already an account with this name.
fr: Un compte portant ce nom existe déjà.

source: Account added
fr: Compte ajouté

source: Could not add the folder
fr: Impossible d'ajouter le dossier

source: There is already a folder with this name.
fr: Un dossier portant ce nom existe déjà.

source: Folder added
fr: Dossier ajouté

source: _File
fr: _Fichier

source: _Edit
fr: _Modifier

source: Add account
fr: Ajouter un compte

source: Add an account to the database
fr: Ajouter un compte à la base

source: Add folder
fr: Ajouter un dossier

source: Edit item
fr: Modifier une entrée

source: Edit selected item
fr: Modifier l'entrée seléctionnée

source: Delete selected item
fr: Supprimer l'entrée sélectionnée

source: Set key
fr: Définir la clé

source: _View
fr: _Afficher

source: Show password's text or not
fr: Afficher ou masquer le texte

source: Show password
fr: Afficher le mot de passe

source: Show the account by tags
fr: Afficher les comptes par tags

source: Show tags
fr: Afficher les tags

source: _Help
fr: _Aide

source: Open another database
fr: Ouvrir une autre base de données

source: Save
fr: Sauvegarder

source: Save the current database
fr: Sauvegarder la base de données courante

source: Add
fr: Ajouter

source: Edit
fr: Modifier

source: Edit the selected item
fr: Modifier l'entrée sélectionnée

source: Delete the selected item
fr: Supprimer l'entrée sélectionnée

source: About PyPass
fr: À propos de PyPass

source: Quit PyPass
fr: Quitter PyPass

source: PyPass website
fr: Site web de PyPass

source: Select your key
fr: Sélectionnez votre clé

source: Password
fr: Mot de passe

source: Add an account
fr: Ajouter un compte

source: Name
fr: Nom

source: Generate
fr: Générer

source: User
fr: Utilisateur

source: Account information
fr: Informations sur le compte

source: Cancel
fr: Annuler
